Scheduler/src/InformationRegisters/СведенияОМобильныхКлиентах/СведенияОМобильныхКлиентах.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СведенияОМобильныхКлиентах</name>
  <resources>
    <name>ДатаПоследнегоВхода</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ИдентификаторПодписчикаУведомления</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИдентификаторКлиента</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Scheduler/src/CommonModules/МобильныйКлиентВызовСервера/Module.bsl
Процедура ЗаписатьИнформациюОМобильномКлиенте(Знач Сведения) Экспорт
	
	НачатьТранзакцию();
		
	Попытка
			
		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.СведенияОМобильныхКлиентах");
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		Блокировка.Заблокировать();

		ЗаписьМобильныйКлиент = РегистрыСведений.СведенияОМобильныхКлиентах.СоздатьМенеджерЗаписи();
		ЗаписьМобильныйКлиент.ИдентификаторКлиента = Сведения.ИдентификаторКлиента;
		ЗаписьМобильныйКлиент.ИдентификаторПодписчикаУведомления = Новый ХранилищеЗначения(
			Сведения.ИдентификаторПодписчикаУведомления, Новый СжатиеДанных());
		ЗаписьМобильныйКлиент.Пользователь = Справочники.Пользователи.ПустаяСсылка();
		ЗаписьМобильныйКлиент.ДатаПоследнегоВхода = ТекущаяДатаСеанса();		
	
		ЗаписьМобильныйКлиент.Записать(Истина);
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();						
		ВызватьИсключение;
			
	КонецПопытки;
	
КонецПроцедуры
